Repository: RotRot-pi/clean-todo
Catalog: l10n/app_*.arb
Languages: sw

# listTasksScreenTitle
source: Hello, World!
sw: Hujambo, Ulimwengu!

# addTaskScreenTitle
source: Add Task
sw: Ongeza Kazi

# taskTitleHint
source: Enter task here
sw: Ingiza kazi hapa

# saveTaskButton
source: Save Task
sw: Hifadhi Kazi

source: Something went wrong
sw: Kuna kitu kimeharibika

# networkError
source: Network error. Please check your connection.
sw: Hitilafu ya mtandao. Tafadhali angalia muunganisho wako.

# cacheGetError
source: Failed to retrieve data.
sw: Imeshindwa kupata data.

source: Not found
sw: Haijapatikana

source: Validation failed
sw: Uthibitishaji umeshindwa

# cacheDeleteFailed
source: Failed to delete data.
sw: Imeshindwa kufuta data.

# cacheGetFailed
source: Failed to retrieve data.
sw: Imeshindwa kupata data.

source: Network failed
sw: Mtandao umeshindwa

# cachePutError
source: Failed to save data.
sw: Imeshindwa kuhifadhi data.

# cacheDeleteError
source: Failed to delete data.
sw: Imeshindwa kufuta data.

# emptyFieldError
source: Field cannot be empty
sw: Uwanja hauwezi kuwa tupu

source: No internet connection
sw: Hakuna muunganisho wa intaneti

# serverExceptionMessage
source: Oops! Something went wrong on our end. Please try again later.
sw: Lo! Hitilafu imetokea upande wetu. Tafadhali jaribu tena baadaye.

# invalidArgument
source: Something went wrong while processing your request.
sw: Hitilafu fulani imetokea wakati wa kushughulikia ombi lako.
